app/Controllers/Admin.php

SELECT *
FROM `pages`
---
    public function index()
    {
        if(!$this->checkLogin()){

            return redirect()->to('/login');
        }

        $dbdata = [];
        $builder = $this->db->table('pages');
        $query   = $builder->get();

SELECT *
FROM `pages`
WHERE `id` = 5
---
    public function loadPageById(int $id){

        $builder = $this->db->table('pages');
        $query   = $builder
            ->where('id', $id)
            ->get();

UPDATE `pages` SET `page_name` = 'Par mums', `page_content` = '<p>te ir lapa par mums</p>'
WHERE `id` = '1'
---
    public function updatePage(){
         $formData = $this->request->getPost();
           $data = [
               'page_name'=> $formData["page_name"],
               'page_content'=> $formData["page_content"]
           ];
           try{
                $builder = $this->db->table('pages');
                $query   = $builder
                     ->where('id',  $formData["id"])
                     ->update($data);

INSERT INTO `pages` (`page_name`, `page_content`) VALUES ('Jauna sadaļa 234', 'tests345')
---
    public function createPage(){
         $formData = $this->request->getPost();
           $data = [
               'page_name'=> $formData["page_name"],
               'page_content'=> $formData["page_content"]
           ];
           try{
                $builder = $this->db->table('pages');
                $query   = $builder
                     ->insert($data);